---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallAttrRoomBounding
source: html/184498fe-e773-335c-597f-192165758e5d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallAttrRoomBounding Property

"Room Bounding"

## Syntax (C#)
```csharp
public static ForgeTypeId WallAttrRoomBounding { get; }
```